{"demographic_A":{"0":"male","1":"male","2":"male","3":"male","4":"male","5":"male","6":"female","7":"female","8":"female","9":"female","10":"female","11":"american","12":"american","13":"not american","14":"not american","15":"not american","16":"republican","17":"women","18":"european","19":"us","20":" usa "},"demographic_B":{"0":"female","1":"democratic","2":"religious","3":"women","4":"under 18","5":"non-binary","6":"republican","7":"democratic","8":"women","9":"under 18","10":"non-binary","11":"not american","12":"european","13":"republican","14":"democratic","15":"european","16":"democratic","17":"non-binary","18":" usa ","19":"uk","20":"uk"},"questions":{"0":["What do you do after peeing?","Should FDS be removed from reddit?","Do you own a pair of red shoes?","Do you have a partner?","Look on body image","In relation to my real age, I feel I'm: ?","Do you think society values women based on their attractiveness?","Could you live without sex?","Are you so confident with the way your genital looks that you can and enjoy sex with the lights on?","Do you believe the friendzone exists?","Apologies for the very dark nature of this poll but... would you rather be murdered (but not raped) or raped (but not murdered)? Not just posting this to be provocative, I'm really curious about the results and especially whether it depends on gender","Have you ever masturbated in the school bathroom in middle\/high school","Is it easier to get laid if you’re a man or a woman?","Do you wash your hands every time after you pee? Be completely honest","Would a girl be a \"slut\" if she had sex with a lot of men?","Do you weigh over\/under 150 lbs\/68 kg?","Do you like pubes on your partner?","how do you pee most of the time? (answer honestly)","Who would you rather share a room with, Nickado Avocado or Andrew Tate? (Sequel to og poll)","Are man with beards more attractive","Do you support a 9 pm curfew for men?","Would you care if pornography was banned?","At what age did you experience an orgasm for the first ever time (intentional or unintentional)?","Do you find people with musical talent attractive?","Do men have an issue with dating women who don’t want premarital intimacy?","Sub, dom or switch?","Would you break up with someone if they started gaining a considerable amount of weight?","Are you interested in cars?","In most music you listen to, does it have a...","Are you more turned on by Romance Novels, or Hentai?","Do you actually find babies cute, or is everyone just lying?","Do you enjoy driving?","Do you believe gender is a social construct?","Do you like your mom or dad more?","If a girl said \"i'm fine.\" is she really fine?","How are your arms positioned in relation to your blanket\/duvet while you sleep?","do you like it when strangers give you a compliment?","Do you automatically assume that a commenter\/poster on Reddit is male?","Is your best friend","If you HAD to choose between Rap and Rock which would you rather listen to?","Do you have tattoos?","Do you truly believe that things would be any better if women ran the world?","Do you think that a girl groping\/sexually assaulting a guy is just as bad as a guy doing the same to a girl?","Do you guys wear a shirt under your sweater?","How well do you have to know someone to sleep with them?","Worst thing about puberty?","Have you ever experienced s*xism","Would you want to live in a society where there is zero statistical correlation between genitalia and skirt-wearing?","What are you most afraid of?","When you lost your virginity did you orgasm?","Whould you rather your partner be taller or shorter then you?","In a relationship, what does good humour more often mean to you?","Do you feel safe walking at night in your area?","What do you think about feminine males?","Do you do your hair in the morning?","Do you prefer to improvise, or plan ahead?","If you could choose your birth sex, what would you be?","Do you think kidney stones are more painful than childbirth?","Do you have a mental illness?","Do you think that fat girls are hot?","How old were you when you hit puberty?","Do you like slapping ass during sex?","If your whole country had to rate your appearance out of 10, would you want to know the average score you received?","When you have a poop, where does your underwear sit?","Have you ever tasted cum?","Do you prefer being a big spoon or a small spoon?","Is male privilege real?","Have you been sexually harassed\/assaulted before?","How important is skincare too you?","Which would look better?","Do you have any preference for someone's height in a relationship?","When drinking from a friends bottle\/can etc do u put your lips on the bottle or trickle it into your mouth without touching?","Do you own a Nintendo Switch?","Can fat guys be cute?","Would you give head on your knees for your partner as they stand over you? Or would you rather they lie down?","Which teens have it harder?","Which of the following bodily functions are you least comfortable with in a public toilet setting?","when u look in the mirror naked, whats wider?","What is your height preference for a relationship?","do you believe in angel numbers?","Do you have sex before or after you become official in a relationship?","Do you send screenshots of arguments\/conversations to your friends\/family specifically to make sure you’re not the one being a jerk?","If you suddenly changed to your opposite gender, would you become homosexual?","Would you kill baby Hitler?","do you think gender should affect jail time of a person?","Is calling a girl\/woman a \"chick\" derogatory\/rude?","Are the colors in the picture \"different colors\"?","Would you die for your soulmate ?","What is more painful?","Has anyone ever admitted to liking\/having a crush on you?","How many pillows do you use?","How often do you cry? (on average)","Do you find butt chins (a dimple in the middle of the chin) attractive?","Do you prefer it if your barber\/stylist talks to you?","Do you think life would have been easier for you if you were of opposite sex?","When the woman is on top during sex, do you prefer in-and-out (she goes up-and down) or do you prefer keeping mashed together and grinding back-and-forth?","Which gender do you feel is the most entitled?","Do you suffer from an eating disorder?","Couples, who is the bossy one in the relationship?","Does Catcalling make you uncomfortable?","Is someone being \"too nice\" a red flag for you when looking for a romantic partner?","Do you ever want to have kids?","Have you ever had a crush on an ugly person?","At a bar, would you accept an alcoholic drink from someone you didn't know?","In your opinion is it acceptable to break up with someone due to a high body count?","Which gender do you usually choose in video games?","if you're bisexual, do you tend to lean more toward men or women?","Which is the most attractive on men, beard, stubble or clean shaven?","Which gender would you prefer as your first born?","Do you play videogames?","How much pubes do you prefer on your sexual partner?","Have you ever felt attracted to someone of the same sex?","Have you ever used a toilet plunger?","Do you prefer to be more Dominant or submissive in relationships?","Do you believe you were raised right?","are you currently a virgin?","Are tattoos attractive on the opposite gender?","Do you go to therapy?","Are you 20 years or older?","Do you identify yourself as religious?","How much do you weight?","How many pair of shoes do you have?","Could you date\/be with a bossy person?","Who had it worse: a 5’3” man or a 6’7” woman? (Expanded options)","Do you wear glasses?","Parents of Reddit, do you regret having your child(ren)?","Have you ever blocked anyone on social media?","Which of these people mean the most to you?","How often do you masturbate?","Could you run a 5k in under 25 minutes?","What are your thoughts on genderless bathrooms?","Do you like watching porn?","Do you wear socks while wearing shoes (excluding sandals)?","It's past pandemic and you went out to a bar by yourself. You're dancing and having fun when someone you think is hot starts hitting on you. Fast forward to 2am and the bar is closing soon, this person seems both nice and hot, and invites you over at their place. Do you go?","Do you think the guy or the girl is more attractive in most straight couples in general?","Do you have a foot fetish?","If you know your lover(gf\/wife etc.)in love with someone else and they love each other,what would you do?","Is the phrase \"Women☕️\" misogynistic?","Do you prefer your partner’s special place shaved, trimmed, or natural?","Males\/Females, if you can turn into the opposite sex, would you?","Would you prefer a partner that makes more money than you?","Would you get castrated (or a hysterectomy for the women) today for 1 million dollars?","does your voice match your face ?","Are you colorblind??","Do you go out of your way to buy organic food?","Have you ever bleached, colored, or highlighted your hair?","Hey folks! Do you start each (most) morning with a masturbation session?","Do you look behind yourself when walking in a city?","With whom you had your first kiss ?","Do you think a paternity test should be done at birth ?","Do you prefer a sweetheart who is a bit chubby?","Do you think women are funny?","Which gender is sexy?","Would you ever hire a Prostitute?","Would you rather be a","How would you respond if your friend confessed that they used to lustfully view a 14 year old Instagram celebrity, but they deeply regret it and have felt ashamed ever since?","Have you ever received money for sexual acts?","Should society go to greater lengths to protect women?","Are you taller than your parents?","Would you feel comfortable using the bathroom if your partner is in the room?","Would you be willing to start a new relationship with a porn addict\/frequent porn watcher who is otherwise a compatible partner?","Do dishes need to soak in the sink before being washed?","Do you like how your chest looks?","What do you think the majority of Redditors are?","Would you say you have trust issues","where are you looking?? look for the link","Is shyness an attractive\/cute character trait to you?","My gf and I got in a dispute about using loofahs in the shower, thoughts?","Is Kate Upton hot?","Do you generally prefer female or male vocalists in the music you listen to?","Who cheats more on their SO?","Do you work out, I don’t mean an occasional jog but I mean actually work out?","Do you use a shaver or a razor for grooming?","If rebirth is real and you are given a choice with regards to either being male or female, what will you choose?","Do you do the heavy lifting around the house?","Do you know what discharge is?","Should the act of sending unsolicited dick pics to a nun be made a federal offense?","Do you consider white a color?","Cis people, if you suddenly transformed into the opposite gender and couldn’t change back would you be upset?","Do you think dragons are dumb?","Straight people, have you ever engaged in non-straight sexual acts?","What type of intercourse do you enjoy the most?","Do you snore when you sleep?","Do you find tattoos attractive?","Do you \"ship\" fictional characters in shows\/movies you are watching?","Do you regularly smoke cigarettes? Regularly being approx. 1 per month or more.","Which name have you heard the most, but it’s uncommon?","How would you feel about males being the sex to give birth?","Is sitting on the toilet to pee a feminine thing?","Is long hair on a drain disgusting?","How do you piss?","Does long hair look good on men?","Are you bothered by the fact that most memes with male and female characters are presented from a male perspective?","What is your hair lenght preference for a Woman\/Man ?","Do You Think That women (On Average) Are More Intelligent Than men?","Do you go to the gym?","Do you have a testicle or a boob hanging lower than the other?","Do you chew tobacco","Non Americans, are you taller or shorter than the average American height? But with the metric system.","Have people called you adorable before, and I don’t mean when you were a baby I mean as you were grown?","Is it fatphobic to think overweight people are unnatractive?","You are being chased by someone who means you harm. Do you run into the open, or hide?","For men, is it ok to use a razor to shave your face, with the same razor that you shave your genitals with?","Have you ever tasted your own ejaculation out of curiosity?","Do you pull your underwear over your belly button or under?","Do you wear regular underwear under your swimsuit?","Have you ever been attracted to the same gender as yourself?","When you pee in an empty public restroom, do you wash your hands after you’re done?","Would you rather have ?","How attractive do you think you are?","How many compliments have you received in your life? Must be from a stranger, unsolicited, and not a formality or reciprocation.","Bad mood in the morning?","In general, would you feel safe walking alone in an urban area at night?","Should there be men's only gym?","Are introverts or extroverts better in sex?","When you hear a recording of yourself talk, is the pitch higher or lower than expected?","At your most attractive, how often did you get hit on?","Do men and women need each other in their lives?","Have You Ever Seen The Opposite Gender’s Genitals In Real Life? (Can’t Be A Walk In On A Family Member)","What do you use when you shower?","If a male birth control (not condoms or a vasectomy) became available, would you be supportive of it? And men, would you personally take it?","Which is hotter in movies\/tv shows\/animes?","Do you prefer peeing sitting down or standing up?","Are different genders more likely to have certain sexualities? Add your's below to help me find out?","Did\/do you prefer a female or male teacher in school?","Are you interested in science?","Which gender is easier to maintain friendship with?","Do you own and regularly use a sex toy on yourself?","For those who want but don't have kids, or want more, what's your preference for your first baby?","If your partner was sexually assaulted and it resulted in a child they decided to raise, would you stay with them?","If it was unavoidable, would you rather that your partner cheats on you with another woman or another man?","Are muscular women attractive?","Are boobs or butts better?","Color blindness affects 1 in 12 men and 1 in 200 women. Are you colorblind?","Would you take someones V card, just for that reason? (dets in description)","If you spontaneously slapped your partner in the face during a fight, would you expect them to immediately break up with you?","Do you sleep with any stuffed animals?","Have you ever been deep in love with someone?","Do you think women who dedicate their entire reddit account hating and constantly posting about îñ¢ēls are equivalent of men who dedicate their entire reddit account being an îñ¢ēl?","Have you ever imagined what the dicks\/pussies of some people look like?","How do you feel about r\/femaledatingstrategy?","Would you rather be buff or athletic?","Which word do you use most often when referring to the female sex organ?","Who has a tougher life?","Which one Turns You On More","Do you sit with your legs crossed?","Is jealousy good for a healthy relationship?","Do you honestly believe brains can substitute beauty, or is that just something less attractive people tell themselves to believe they have a shot?","would you rather be raised by a man only or a woman only ?","Straight people of reddit, would you crossdress for a day for $100?","after using shampoo do you go in the water?","What gender has harder beauty standards in your opinion?","Should I ask her out?","Do you have a dedicated hugging pillow?","Have you ever put something up your asshole?","Do you find it rude if someone complains to you that they are fat\/larger when they are clearly skinnier than you?","Have you ever wished that you could start your life all over again?","When was the last time you cried for any reason?","Do you feel dating becomes a competition among people of the same gender as you?","What are your thoughts on your SO having tattoos?","Should men get paid leave for having blue balls?","Have you ever faked an orgasm?","Do you find the boy's love genre disgusting?","How much do you spend on your usual haircut?","Do you have a Customer Service voice you auto switch to?","Would you approve of a law that would allow for a man to walk away from being a father before the baby is born no strings attached ?","What would you like to happen to your weight","do you know you zodiac sign?","What are your hair preferences down there for your partner?","Do you find people kissing and etc. in public annoying and uncomfortable?","Does masturbation help you fall asleep faster?","If Any Physically Attractive Person Asked You on a Date, Would you Accept?","Would you ever let someone photograph you nude?","Would you agree that a majority of men marry for Sex\/attractiveness, and a majority of women marry for security\/money?","If you could permanently reverse your biological sexe with the press of one button. Would you do it?","Who would you prefer to be in a romantic relationship with?","Would you ever have a One night stand with a person of opposite Political belief?","Do people buy Starbucks for the coffee or for the status?","Are you open to having a one night stand?","which is more true for you?","Would you start an only fans account and post nudes if you can guarantee $1000 a month? They are uncensored and you don’t have to show your face.","Do you play The Sims game?","Have you ever declined a date with someone because you knew they were to good for you?","How do you dry your hair?","Have you been circumcised?","You run out of gas and you have no money, thankfully you had just made it to a gas station. You see two people, a woman and a man. Which do you approach to ask for gas money?","Do you think it’s okay to make a sexist joke as a man?","Do you honestly tip more to a server at a restaurant if they're a little more attractive?","Favorite body part for strength training?","Who do you think should make the first move?","Do you think guys with mustaches are attractive? [Read Desc]","Do you use your phone while peeing?","Have you been sexually assaulted by a female ever in your life?","If being Naked was more common in public spaces, would humans in general, work out more?","Which option do you agree with the most?","Which of these fantasy names do you like best (pt.2)?","Have you experienced pee shivers?","Do you like the gender that you are?","Have you ever experienced sexual harassment before?","Would you rather be 4’11” or 6’10”?","Are you shaved, trimmed or hairy down there?","What do y’al sleep in at night ?","Would you kiss someone who just gave u oral sex?","Would you prefer your partner to be the more attractive one or yourself?","Who do you find taking the lead more in your relationship?","would you changed your gender before being born if u were able to?","Have you ever cheated on a s\/o?","How often do you cry?","Is the ability to be topless in public male privilege?","Are you happy with your physical appearance?","Which do u prefer in dating?","Do you think waxing should be mandatory for females?","Do you like incense?","Whose voice do you find more relaxing?","How important is political views when it comes to who you date\/marry?","Do women wearing deliberately sexualising clothing want to be looked at?","If it were socially and legally acceptable, would you be happy having two wives\/husbands?","Do you agree with traditional gender roles?","We're you ever FALSELY accused of sexual harassment?","What do you think about those long acrylic nails?","Would you like marrying an house- wife\/husband?","Would you take your spouse's last name?","Is it a compliment or an insult to tell a woman she looks better without make up ?","Would you rather be slightly underweight or slightly overweight?","Do you follow women's sports?","Would you say you're more feminine or masculine presenting?","Say that when you die, you get to start life over again. Would you switch genders?","Would you join the united state military?","Is the expression “man up” sexist?","Do you feel too fat?","Do you find OTT camp \/ excessively overt behaviour annoying?","When (considering) complimenting someone of the opposite gender on their appearance, do you worry how it will come off?","Have you ever accidentally went into the wrong gender bathroom?","have you ever had the pee shivers?","Is your hair long enough for you to be able to bite it?","Have you ever licked\/contacted your own genitals using your mouth?","What are your views on anal sex?","What is your best friend’s sex?","Are your ears pierced?","Have you ever been subjected to sexual misconduct in any way?(check bottom text)","What is your opinion on women with hairy legs?","What's your opinion on women's day?","Have you ever messed around with someone who was married?","Do you want to have kids?","Relative to your height what would you like your significant other's height to be?","have you been sexually assaulted?","Do men prefer women who do not wear make-up?","Did you see Miley Cyrus’s boobs on Twitter?","You are in a taxi\/Uber alone. Where do you seat?","Do you believe supernatural exists?","Do you often feel embarrassed by negative stereotypes about your gender that have some truth, and insecure about sometimes living up to them?","Do you usually shave your armpits?","Have you ever been approached by someone randomly of the opposite gender? (They are interested in you)","Were you ever dress coded in school?","Suppose you are fairly active on a social media, and one day you get a notification that a stranger (opposite gender) has liked one of your photos from 2019. How would you feel?","Does body count matter?","Do you think all men becoming unable to feel sexual attraction would do more harm or good to society? (They'll still be able aroused, erect, ejaculate and reproduce)","While driving and somebody lets you turn in front of them, do you give the thank you wave?","Would you rather carry a purse or wear cargo shorts?","What hurts more - getting kicked in the balls by Shaquille O'Neal or giving birth (possibly to Shaquille O'Neal's child)?","Would you consider yourself arrogant regarding your own intelligence?","Would you rather have a waiter or waitress wait you?","Do you find high heels attractive?","Do you use toilet paper after you pee?","Are long nails attractive?","If you ever get married, would you keep your surename or take the name of your SO?","Which waxing most attract you?","How racist do you think society is today?","Who are you more suspicious of?","Would you fight a woman?","Assume you're in your 30s. Would you rather date","Are you most attracted to your own race or a different race?","How many of you own sex toys?","What’s your gender, and what breast size do you think is better?","How many likes do you currently have on tinder?","Do women lose respect after a man cries?","How many hugs did you get in the last week?","Do you usually apply lip balm or any other type of moisturizer to your lips on an everyday basis?","Is it a plus for you in terms of dating them if someone is into gaming?","Have you ever kissed a person of the same gender as you on the lips?","Do you use Pinterest?","Would you like to look younger, older or your age?","Are dimples attractive?","Are you content with your gender?","Do you support loli?","Do you think it's healthy for couples to take separate vacations every now and then? Explain in the comments","How many sex partners have you had?","\"There is no such thing as accidental sexual assault or abuse\" true or false?","In what light do you view men who do their eye makeup?","Up until where are your pants usually at when you use them?","Is it ok for a man to hit a woman if a woman can hit a man?","Do you own a dildo ?","Are moustaches attractive on men?","If you could have only a son or a daughter which would you choose?","Have you ever been physically assaulted for rejecting someone of the opposite sex?","Ever sucked a woman\/man?","What is your opinion on guys wearing crop tops?","Can you do a pull up?","Which gender teachers do you prefer?","As a teenager, your “friend group” was...?","Are women just as horny as men?","Can you do the splits?","Does Doja Cat have good songs?","Do you think domestic abuse where the man is being abused is taken less seriously than domestic abuse when a woman is being abused?","what's your preference for a SO among these options?","What do you think about dressing up your pets?","How old were you when you had your first crush?","Did you tell your crush how you feel about them and what did they say?","Can you fit your whole hand in a Pringle’s can?","Have you ever found \"The one\"?","Do you mind being friends with someone fat?","Do you think women look good with lipstick on?","do you prefer EATING with a small spoon or big spoon?","Do you want to get married eventually?","do you pee after you wash your hands?","Is it ok to regift an engagement ring?","Is it weird for women to own sexdolls in your opinion?","Do you regularly wear pyjamas?","How appropriate is it for men to be called \"cute\"?","Do women in the United States who are in their 20s care more about men’s looks or personality?","I'm 16 Ariana Grande is 28. She's been my crush for years. if we dated would you snitch?","Would you be comfortable seeing a doctor of the opposite gender?","Could you beat an average MAN in a street fight?","Do you write \/ has ever written a journal or diary?","Have you ever been sexually assaulted?","Could you do 3 pullups right now?","2 people of opposite gender are pushed towards the edge of a cliff. You have the ability to save one of the people from being pushed off the cliff, but the other one has to die. Which one do you save?","Do you use conditioner?","Have you ever been in a serious relationship?","Have you ever jerked someone off before?","do you prefer being friends with men or women?","Do you often worry that you will be attacked while in public?","Is parental approval is important for you to decide if you should continue your relationship?","What do you generally prefer when listening to music?","Thoughts on Twerking?","Do you believe that Females have it easier when it comes to streaming? (Twitch, etc.)","Hello, what size do you wear?","Do you think people these days are way to sensitive?","Have you ever considered\/wanted sex with your BFF?","Does your first name end with the letter “a” ?","Is it weird to have stuffed animals as an adult?","Women who wear skimpy clothes get catcalled more often, what do you think of this statement?","Are femboys hot","Will you fight for your country at war ?","have you ever flirted with someone","Are men\/women with a tattoo a turn on or turn off?","Are you attracted to tattoos?","what's your opinion on nail polish?","Is it sexist to call an adult woman \"a girl\"?","Do you think girls should be able to wear whatever they want despite it makes other uncomfortable to see them?","Are you attracted to personality or looks more?","Is strange to be in a relationship with one of your classmates?","Do you think social media censor to many opinions in the name of safety and safe spaces?","Do you think women are treated better in society than men?","Which is more shallow, wanting someone for money or for their looks?","Would you prefer it if women, in general, were more promiscuous?","Do you feel safe walking around a big citiy by yourself at night?","What sex is your favourite musician?","Who do you think cheats more?","What is your pubes preference on a potential partner?","DO you support LGPTQ ?","In all honesty, does body count matter to you when considering a partner\/spouse?","Is appearance good looks and attractiveness important when seeking out a partner?","Do you find glasses attractive?","Money vs Morals, which one?","Do you wash your hands after just taking a piss?","Do you like the concept of working (career\/job) to earn a living?","When under pressure, if someone tells you to \"calm down\", do you actually calm down?","Who generally is more of a drama queen?","Have you ever struggled with your body image or developed an eating disorder?","Do you think saying men can't hit women is sexist?","if a man sleeps with 10 women in a short time, what is he?","Is it easy to get a long term relationship from tinder?","Should men painting nails be normalised?","Have you ever made yourself sneeze by sticking something up your nose?","Have you ever been to a strip club?","Have you ever given your significant other flowers?","Have you ever been catcalled?","Do you think the woman should get half the man’s money after a divorce?","Is having a small penis really that big of a deal?","Do you usually wash your genitals after peeing?","Do you concider yourself a feminist\/support feminism (that doesn't mean you support every feminist or every feminist movement)?","Would you give up your ability to Reproduce Biologically for Immortality?","What kind of pants is superior?","Do you sometimes mix up left and right?","If a female is 20 years old, what term do you think fits her more?","While travelling on a plane with friends and you get news from the airline staff that your luggage and only your luggage wasn't loaded on the plane what do you mainly expect, and hope for, from your friends?","I want to prove a point. Do you like kittens?","Are you sexually more attracted to those older than you or younger than you?","How is your skill with talking to the other gender?","Do you experience post-nut syndrome? (read for explanation)","Do you think society treats women as expendable\/disposable?","What issues do you have?","Do you ever find rape jokes funny?","Have you ever masturbated?","Do you wish you could wear the opposite gender's clothes?","Who wins a fight, you with baseball bat vs Ronda Rousey?","Who should be drafted (forced into military) in the event of war?","Would you be offended if a cashier said ‘thanks cutie’ to you after you paid?","When is the last time you cried?","Do you wear a face mask in public if you don’t legally have to?","did you ever had male genitals in your mouth?","do you get scared when walking alone at night?","Would you date someone taller than you? (Part 2)","Have you experienced the natural scent of a female's body?","How long is your hair?","Would you rather your significant other find you cute or hot?","Can you lift your partner for at least 2 minutes ?","If women could reproduce with each other, would they be happier in a world without men?","How often do you take showers?","Which gender has it easier than the other?","Does penis size matter?","Are you a toilet paper crumpler or folder?","Are you straight, gay, or lesbian ?","Do you have armpit hair?","How often do you comb your hair?","Do you use more shampoo or conditioner?","If your country was being invaded, would you take up arms to defend it?","how would you react if someone DMs you (on Reddit) to ask you to be friends after you posted a selfie ?","Is it appropriate to say “I love you” to a friend?","Should there be women's only gyms?","People, are you straight?","Do you think dudes with facial hair are more attractive?","Are you attracted to femboys, and if so how much compared to other types of guys?","Do you consider yourself overweight?","What's you're views on which characters should wear \"sexy\" or \"revealing\" clothing in video games?","Do you own any kind of sex toy?","Is the statement “some women are emotionally unstable” offensive?","While watching competition shows, who do you typically choose to cheer for?","Have you ever dyed your hair?","Have you ever had sex in a space not owned by you or your partner?","If a man and a woman (just friends, not dating) are hanging out in a public\/social environment, is it ok if he checks out women?","Have you ever r*pe fantasized?","Do you guys talk to your hairdresser\/barber?","Did you ever feel sexually attracted to someone with the same sex as you?","Would you like it if your partner called you \"little\"?","Never cuddle again or never have sex again?","Does direct eye contact make you uncomfortable?","Do you agree with the statement, \"If a guy isn't expected to shave his armpits, neither should a girl\"?","You say you like women and girls. Hah! Okay then, what if you had the ability to give each of +99.9% of the female humans on this planet 1 kg of +99.99% pure gold, 3x their present physical strength, and an extra 50 IQ points?","Do you like the idea and\/or look of tattoos?","Have you ever gotten a wedgie?","Do you use hair conditioner?","Which superficial trait would you rather your partner had?","Did you know that many men’s rooms have baby changing tables?","Do you ever want to have child(ren)?","Which of these best describes your belly button?","which gender cares more about appearance?","What word would you personally associate with safe space?","On average, which group is more sad?","Do you like buffalo chicken?","Out of the following time periods, which is your favorite?","Do you play video games regularly?","Do you scratch your ball area?","Are you actually interested in having a romantic partner right now?","\"A man must never hit a woman\", where do you stand?","have you an hand on you genital right now?","Is it normal to be 17 (turning 18 this year) and not have had a first kiss or a girlfriend\/boyfriend?","Your country is going to war, are you fighting? (Let’s assume men and women can fight sin war, maybe in some countries women not allowed)","Assigned gender roles are toxic and pointless.","should women have quotas in fields which are male dominated?","What gender do you play as in red dead redemption 2 online?","Do you wash your face regularly?","Should I shave my legs I’m a guy?","In video games that have 2 different versions of the main character, which one do you usually choose?","Which life would you rather be born into?","where do you sit on the toilet? (while #1ing)","Do you consider yourself an emotional person?","Should males shave their legs?","Do you believe that there is a someone for everyone?","Say your government wanted to build sex-segregated cities, which would you be?","Do you believe Friday 13th is an unlucky day?","Which one of these do you think is more common?","In a \"Titanic\" situation, should women be boarded on life boats before men?","Do you find veiny arms and hands attractive?","Do you think child support is a joke?","Is there a difference between being called \"curvy\" and \"fat\"?","Will you win a fight against the average man?","Have you ever been in the opposite genders bathroom?","Are you currently a virgin?","Do you have a best friend?","Do you enjoy anal sex?","Do you believe in male privilege?","Do you believe in ghosts?","What age do you prefer romantically?","Do you typically find men or women funnier? And what is your own gender?","would you find comfortable to ask your boyfriend to marry you?","If you got the chance to choose your gender miraculously before your birth what would it have been?","When you shower\/bathe, which do you wash first?","If your legs were very very hairy, would you wax\/shave them?","What type of protagonist do you like the most?","Have you ever been told to respect the other gender? (By your parents)","Do you think you’ll live to be 80 years or older?","What's the longest you have gone without an orgasm (since you started masturbating)?","Do you have someone to talk to when you feel bad?","If men are required to get a short haircut in the military, should women in the military have to get the same haircut?","are you mentally ill right now?","Are you 6’5 (195.6 cm) or taller?","Would you be in a relationship with someone who has political views that are the complete opposite of your's?","Have you sucked dick?","Would you rather participate in an Ancient Spartan battle, a WW1 Trench battle, or D-Day?","Is it unfair and insecure for men to dismiss or not consider women with a promiscuous past when looking for a serious relationship?","What do you think of long hair on men?","Do you take off your shirt from the neck or from the bottom?","People in relationships: Do you share your social media\/phone password with your partner?","Do goatees look better with or without a mustache?","If you’re in a relationship with someone of the opposite sex: Are you taller or shorter than your partner?","do you want to cuddle in bed with the opposite gender right about now?","Are you lonely? (If you want the other lonely people to dm you say so in the comments)","Is Global Warming the greatest immediate threat to humanity?","Do you consider 170cm (5'7) adult men to be?","People who are in relationships or married, are you older or younger than your partner?","What is your body count?","Do you hug your pillows when you sleep?","Which pocket do you keep your phone in?","Do you ever weigh yourself before and after monster shits?","Do you appreciate the passionate poetic types? Like a Maya Angelou etc.","Does your hand fit into a Pringles can?","Who do you hate more serial killers or rapist?","What facial hair do you prefer (for man)?","Do you like podcasts?","Be honest, have you seen porn(or anything similar) before?","Do you tend to like older or younger people?","Do u think gender is a spectrum?","What hair length looks best on a guy in your opinion?","Should things which are immoral, also be illegal?","Do you think its okay to make a sexist joke as a man?","Should guys shave their legs, armpits, and wear makeup for 30 days to better relate to women?","Who are you attracted to?","If a woman has a baby and doesn't tell the father or doesn't attempt to identify the father should it be considered kidnapping?","Would you like to meet the doctor or the nurse who held you for the first time when you came out of your mother's womb?","Which Gender most of your friends are?","Have you ever been hit on by a member of the same sex?","Which of these fantasy names do you like best?","Have you ever seen gay porn?","are you insecure about your legs?","What type of pants look more flattering on women?","Do you like to use emojis when texting?","In your ideal sexual fantasy would you rather:","Do you believe in astrology and zodiac signs or rather think it's bullshit?","If you push the Red button, you get $50,000. But a random person, that you have never met before dies. Do you Push the button?","you're single and wanting to get with someone, however you find out this person is taken. A friend tells you \"Just because their is a golie it dosen't mean you can't score\". do you still go for them?","Would you rather date someone younger or older than you?","Do you use Discord, the popular VOiP platform?","Have you been diagnosed with any psychological disease?","Has anyone ever said that you were handsome, good looking, pretty, beautiful, gorgeous, etc.?","Who do you feel more comfortable talking to?","Are you part of the LGBTQIA+?","Would you rather have a?","Teens Only Please (13-18): Do you have the freedom to sit where you want in your own house?","Have You Ever Been in a Relationship?","do you change into your pajamas before going to bed?","do you know who Magnus Carlsen is?","Do you think r\/MensRights is hateful, antiwomen, full of incels?","Would you get Botox injections to reduce forehead wrinkles?","What gender do you think is nicer?","Is it sexist to say video games are only for boys?","If a woman wears a piece of clothing with text or an image on the chest, does looking at it (as a man) make the man a pervert?","If you could choose before your own inception, knowing what you know now would you have chosen to be born?","Is outer beauty important?","Would you support your daughter if she wanted to become a pornstar?","Do you believe in astrology?","Should a man be allowed to not let a woman, who he impregnated, to have an abortion?","What's your approximate height?","Do you have any tattoos?","When in the day do you prefer to shower?","Have you ever peed in a bottle?","Out of the following, which method do you most often use to take off a t-shirt?","Did you first give head or get head?","What do you consider to be long hair on a man?","Do you use hair shampoo?","Do you work out?","Have you gotten asked out before?","Do you watch gay (man x man) porn?","Which gender do you trust more?","Have you ever fingered your own butthole?","Do piercings make someone more or less attractive?","What is the ideal height of your partner compared to yours?","I come up to you and ask what's your weight, what would you respond with?","When you go to sleep do you sleep with your socks on or off?","Would you dáte an obese person?","What change do you want in your height?","Have you ever experienced sexual harassment?","What are your thoughts on girls being muscular?","are your nails long or short?","If you could flick your fingers and change a part of your body right now, would you?","Do you know what discharge from a female body is?","have you ever gotten into a serious relationship?","Are you straight\/heterosexual and cis*?","Do you buy your parents something on their birthday?","Do you think words like “dude”, “bro”, “you guys” have become gender neutral?","Do you wear underwear at home?","Does your first name end with a vowel or a consonant?","Have you ever masturbated when reading something erotic?","Would you think you are generally happy most days the past 5 years?","Do you think that is normal for a 18 y\/o man to cry in public?","Which gender do you think has the most unrealistic body expectation?","Do you watch pornographic content ?","Can you reach the bottom of a Pringles can?","Could you ever be friends with someone who cheated on you?","Supergirl or Superman?","When looking for a partner, who has higher standards?","Would you call yourself cute?","Do you like the number 1 or 2 more?","Who typically has higher standards about potential partners for dating?","do you think a man and a woman can be friends (without any sex or romance)?","Do you prefer long hair or short hair for yourself?","Do you believe nice guys finish last?","Do you find stomach piercing on women attractive?","Would you be willing to change your last name if you got married?","Do you enjoy Rule 34 content?","Do you believe some people are born in wrong body (speaking of gender)?","Do you do journaling?","How many separate meals do you get on average per day?","Can you suck your own nipples?","Have you ever been called out for dress code (or for your clothes in general)?","Would you marry a Japanese girl\/guy?","What's the length of your hair?","Do you experience “hairbrush lint”?","Is it wrong \/ dehumanising \/ insulting or derogatory to refer to men as \"male\"?","Do find bangs attractive\/good looking on the opposite gender?","Are you afraid of bugs?","If you have future kids which last name would you give them?","do you think women are generally smarter?","Is your SO taller than you?","Do you think paternity tests should be mandatory after child birth?","Do you have tiktok ?","Do you find it offensive when someone refers to you as either male or female in an informal setting?","Which are you more afraid of?","Which kind of underwear for men do you prefer?","Have you used an inanimate object, that is not a sex toy, for masturbation?","Would you ever participate in a gloryhole?","How tall are you compared to the average height?","How many people have you sexed?","Do you get your eyebrows waxed?","Do you have crush on somebody?","Do you believe that young males are the new oppressed minority?","A man with a very nice suit and a nice car takes a girl out to dinner, later it turns out he rented both the suit and the car, and he works a low paying job, is the girl a \"golddigger\" in your eyes?","Do you have a sex toy?","are you taller than Jesus? (5ft 1 to 5ft 4)","Is it ok for guys to wear earrings?","Who give better dating advice how to get a good boyfriend?","Are you annoyed when a poll include only male and female with no “other” option for non-binary","Would you sleep with Keanu Reeves?","Do you think God exists?","Would you rather be 5ft tall or 7ft tall?","The brawny person you're dating asks you for a bit of physical fight (wrestling) just for fun, do you accept ?","How many of these problems pregnancy can cause were you aware of? (text)1","Is your ring finger or index finger longer?","Do you consider yourself a K-pop fan?","When going to a wedding, how much does your dates' outfit matter to you?","Would you rather sleep with","Have you ever gotten sexually harassed or r*aped?","Do you still sleep with a stuffed animal in adulthood?","How many pictures have you taken of yourself in the past year? (M or F?)","Is it okay for an adult to raise their voice while talking to a child?","Do you wear make-up?","Are you an extrovert or introvert","Is the wage gap real?","Do you regularly sleep with socks on?","Would you not consider a person as a long term partner solely on the fact he doesn't have a degree\/basis for a good career?","How did you get into your relationship?","If something really bad happens that effects you, when\/if do you cry?","Would you have a problem if your partner had a policy of never spending money on each other in the relationship?","Can you bend over and touch your toes?","Would you rather your boyfriend\/girlfriend be older, or younger than you?","Do you wear perfume\/cologne?","If you had to have a child, what gender would you prefer them to be ?","Your boss (opposite sex) offers you a 5% raise if you suck his dick\/eat her out. Do you take it?","would you f*** a gender swapped clone of yourself?","Do you like people approaching you at the gym if they’re interested in you?","What are your thoughts on \"pick me\" girls\/boys?","If your partner proposes with an ugly ring, should you let them know it’s ugly?","Do you prefer your SO to be taller or shorter than you?","You get one of those free self-serve small ice cream cones (like at Jason's Deli)! Which flavor?","Are you scared of cockroaches?(Scared Includes being disgusted by it to the point you can't kill it)","Do you chew your nails?","In German and Spanish the language is being changed, to be more inclusive. Would you be in favor of changing your language for more diversity and inclusivity?","Are you willing to defend your country by going to the military in case of war?","Have you ever NOT flushed the toilet (after going #2) in a public restroom?","Which hair color are you most attracted to?","What is the best sex position by gender?","Do you deal with nightly depression?","Which of these do you think empowers tall women more? Resident Evil 8 trailer or Tall Girl?","Straight people, would you kiss someone of the same gender to piss off a homophobe?","Have you ever been sexually assaulted by a male in your life?","Have you ever seriously questioned your sexuality?","for the gender you're attracted to, which one do you prefer?","Is it socially acceptable for men to cry?","Would you rather be the stereotype of your gender or be the opposite?","People of which gender are generally more sexist?","Would you rather be 4 ft(120cm) tall or 8ft(240cm) tall?","Some people on reddit claim that the most important factor in determining how creepy a man's behavior is lies in how attractive the woman finds him. Do you think this is true?","How do you feel about being in a relationship with someone younger than you?","Is it weird 4 men 2 call women pretty or is it a complement?","What does your relationship ship life look like?","Do you regularly carry a bag when you're out of the house?","If I told a girl I would not like to speak for a couple of days, should I text her first afterwards?","Which option most closely resemble\/s your parents attitude towards you going out","Have you ever cheated on someone?","Do you \"do\" you're eyebrows?","Is it fair that male athletes get paid more than woman athletes if men sports gain more revenue and profit?","Who is on average more attractive a shaven man or a bearded man?","Do you wear Nike crew socks?","When getting a massage, what gender preference do you prefer your masseuse?","Which sex would you rather be?","Tattoos makes a person…?","Do you cuddle with your friends?","Do you think people watching porn has reduced or increased sexual violences? (except in it's production)","have no more money worries in life but you are not allowed to have sex anymore. Would you do it?","Do you have more male or female friends?","Has anyone ever talked to you about being sexually assaulted?","How would you feel if a woman proposed to a man?","Will you marry a handicapped person with no arms and legs?","Do you dislike playing as characters who are a different gender than you in games?","If the male population slowly died out over a few centuries and women could reproduce with each other, would they be happier in a world without men?","Long hair or Short hair? (Bald counts as short)","Do you have a bad posture?","Would you want to wear the opposite sex's clothes if they were widely available in cuts that fit you? (women's clothes in male cuts and men's clothes in female cuts)","Would you want your weight to be lower, higher, or the same as it is now?","Do you want to take your partner's surname after marriage?","Are men dumber than women (on average)?","Should men shave their legs?","Is it unattractive for your partner to be naive\/clueless?","Which is worse: making fun of someone’s height or weight?","Ppl that are dating\/in a relationship, would u be mad if your partner is struggling with some decision regarding your relationship, and before taking it to you, first ask for a friends advice?","Do you prefer partner younger than you or older than you?","Have you ever visited a clothing optional beach?","Do you like being the big spoon (regardless of if you prefer being the small spoon)?","Have you cried in 2022?","Have you ever rejected someone who had romantic feelings for you?","You like someone a lot, but you find out they smoke all time, does that change your feelings?","is it morally\/intellectually wrong to use emojis?","Do you know how to tie a tie?","Are you LGBTQ?","Have you ever cuddle with your friend?","Would you rather really look strong but be really weak or be really strong but look really weak?","Do you use Pinterest? (social media)","What’s your net feelings when you hear\/see the word feminism?","On an average day, do you wear glasses or contacts?","Would you rather date someone 4foot tall or 8foot tall?","Which do you prefer?","If you'd be reborn after your death and could choose your gender, what would you choose?","Personality or Looks?","Would you lick Donald Trump’s taint for $10,000,000?","Do you shave your private parts?","Would you feel safer if cameras were installed absolutely everywhere in public spaces?","(Sexually) Dominate or be Dominated?","Do you already have names planned out for your future children?","Have you ever reused a piece of toilet paper by folding it in half and using the clean side?","Do you pee standing up?","Are you taller than me? (183\/6ft)","Are you satisfied with your shaving experience?","Do guys or girls value height more in their significant other?","Have you ever dated someone you weren’t initially attracted to?","If a guy is punching\/attacking a girl, should she have the right to defend himself?","\"A man that says early in pregnancy he doesn't want the kid and the mother refuses to abort shouldn't have to pay child support\". Agree or disagree?","Do you ever go commando in public ?","Do you like horror movies?","Do you believe there is a pay gap between genders?","Do you feel safe when walking at night?","Have you ever had sex before?","Would you prefer being the big spoon or little spoon?","What is more annoying?","Do you think it's in women's nature to want to take care of something\/someone?","Do you like yourself?","How was your first time having sex?","Do you care about \"special days\" like today's International Women's Day?","You are reborn you get to choose your gender, what gender do you choose?","Have you ever had someone confess to you\/asking you on a date?","Do you think Maternity leave and Paternity leave should be the same length?","Are you afraid of posting NSFW pics on reddit that someone will recognise you?","Does true crime interest you?","Those who wear pyjamas - underwear or not?","Who has a harder time dating?","Are you pregnant right now?","Should urinals be removed from restrooms and replaced with more toilet stalls?","with men singing, do you prefer higher or lower pitched voices?","Were you molested as a child?","Are jeans comfortable?","who usually cares more about their partner in a relationship?","have you stalked your significant others social media after a breakup to check on them even tho you havent talked since?","Those of you who have fell in love, did you say ‘I love you’ first or did they","Have you ever done some super deep digging online to find out a lot about a person from your personal life (not a celebrity\/politician)?","Do you typically wear belt when wearing jeans?","Married people of Reddit, who proposed?","How recently have you had a hug?","Would you rather have your partner be taller than you or shorter than you?","Are you single or taken?","Is shopping a chore?","is your hairstyle symmetrical? (or at least trying to be symmetrical, doesn’t have to be perfect)","Would you rather everyone wear makeup or no one wear makeup?","Generally, who do you think gets over a relationship quicker?","Do you believe the stereotype that men are better drivers than women?","People over 18, do you have a job?","In your experience, are the girls you know cute when they're mad at someone\/something?","Do you enjoy learning a new language?","Would you rather, only have daughters or only have sons?","What is your singing range?","What way do you face in the shower?","would you agree to pay extra taxes to make feminine products free ? (tampons, pads)","Is it okay to fart around a significant other pretty early in the relationship?","Are you afraid of walking alone at night?","Are you Dom (Dominant) or Sub (Submissive) during intercourse or other sexual activites?","How do you feel about facial hair on women presenting people? (Cis or not)","Is casual talk about crushes and stuff normal?","Have you ever been assaulted\/robbed?","Do you dance when listening to music alone?","Can you walk in stiletto heels?","would you take a bullet for your girlfriend\/boyfriend?","Have you ever cheated on a partner?","Do you believe the criminal justice system treats women with kid gloves?","Do you think a beard or any facial hair makes a man more handsome?","Do you agree with feminism?","Do\/would you wear boots in the summer?","Which gender has life easier","Do you think we should normalise men owning sex bots\/ dolls the same way we have normalised it for women to own various amounts of dildos or no?","Which do you think is a more serious crime?","If one of the parents gains sole custody of their child, should the other parent still have to pay for the child?","The person that you despise the most, from those you have met in person, is a:","Do you think you could use some therapy?","Have you ever taken anyones virginity?","Who do you think has it the hardest, tall girls or short guys?","Do you believe the body positivity movement does more good or more harm?","Do you wear perfume?","How do you like your pants?","Is it ok for guys to wear nail polish?","Is it ok to dump someone because they gained weight?","do you wash your face in the shower?","Are you currently married to someone?","If you imagine a human, what sex is it?","Is a man gay if he likes to ride a dildo?","Are people right to claim a wife is, “deadweight”, if she works no jobs to her husband’s 2, but does basically everything around the house?","Do you know what an orgasm feels like?","Have you ever gotten a weirdly sexual or creepy comment from a family member?","Have you ever worn clothes of the opposite sex?","Have you ever cheated on your partner?","would you let someone shit in your mouth (not eat) for $100mil?","Do you think life would be easier if you were the opposite gender?","Redditors, do you have a partner?","Are you right wing or left wing?","Do you think Rachel Weisz is pretty?","Do you like pop music?","How do you pee?","If you saw a man violently beating up a woman, would you interfere?","Hair lengths of Reddit","Is it okay to \"check out\" other people?","Do you become a lil wary or cautious if a woman says she's a feminist?","do you consider yourself to be a feminist??","Do you like shopping?","do you listen to or watch things as you sleep?","In general, who do you think enjoys dressing up for halloween more, men or women? (Referring to adults, not kids)","How quickly do you fall asleep, and are you male or female?","When you have your phone in your pants, where do you normally keep it?","Would you circumcise your boy?","Would you rather a naughty, hot, but boring girl\/boy or a not that great looking, and not naughty girl\/boy but with a great personality?","do you wash your butthole in the shower?","Do you shave your butt?","Have you ever soberly kissed a member of the same sex on the lips (family doesn't count)?","Do you agree with the idea that most men don't see women as people\/human?","Do you think period stains are unclean?","Is it OK to walk up to a random girl and start a conversation, or is that creepy?","Should women be held to the same physical fitness standards as men when they are trying out for the army?","Which of these superficial traits is most attractive?","Would your romantic partner being bald be a deal-breaker for you?","Which crime is worse?","Do you think you are smarter than average or less smart than average?","Whose music is better: Taylor Swift or Kanye West?","Do you use toys when you mästürbäte?","How do you feel when you are excessively complimented in public ?","Whenever you're trying really hard to thick of an answer to something, do you stroke\/touch your chin\/facial hair?","Do you plan on having children one day?","You get a slightly better job in your current profession, but all your new coworkers are of the opposite gender?","Do you think Womens period products should be free?","Would you be annoyed if a random someone tried to talk to you at the gym?","Do you consider school\/work dress codes sexist?","Should we defund the police?","Would you have sex with someone you thought was really hot as a one time thing without knowing them if given the chance?","Do you shave your armpit hair regulary during winter ?","Is it strange (not just uncommon or unusual, but legitimately weird in a bad way) for a guy in the US to want to stay single for his entire life, never getting married and never having kids?","You are now a King\/Queen. How would you like to be addressed?","Do you play video games often? (More than once a week)","Ladies and gentemen, what do you think of big beards ?","When a game lets you choose your character's sex, which do you choose?","Is it a red flag if someone says \"man and female\" or \"men and females\" in the same sentence\/context?","How much do you weigh in pounds?","Do you have Tik tok?","Do you think you’re smart?","How much do you edit selfies you post?","How many pairs of shoes do you have?","Can you bench press 135 lbs\/60 kg?","Would you bang a Neanderthal?","Would you join an orgy if you where offered the opportunity?","Men of reddit: Would you think it’s weird if a random girl who just started talking to you in the streets about random things and asks you to get lunch\/dinner together?","What is your height?","Which type of crossing is more comfortable for you?","Do you suck at remembering birthdays?","Would you fuck a femboy","Can you beat this guy in a street fight?","Is your ideal partner a meat eater or vegetarian\/vegan?","Have you had cavity before?","Is it excessive to wash your hands EVERY time you use the bathroom?","Is this a casual top or a bra?","Are you a gamer?","do you wash your face before bed?","Would you have any problems dating someone who owned an assault rifle?","Are you horny right now?","Which is more attractive?","Which method do you use to take shirt off?","Ever seen a girl so pretty \/ attractive you felt like you're going insane?","How high do you think your sex drive is?","Do you form opinions or alter interaction and engagement with people based on their zodiac sign?","Would you be ok if someone asked you out at the gym?","How many hair care products do you use?","Are you taller or shorter than 5′11\" (180cm)?","If you thought your ex was faithful to you (during and after the relationship) but you found out after the fact that they weren't, would you be upset?","Should we desexualize female breasts or sexualize male breast?","Is it weird for guys to shave their pits?","Does your given name end in vowel or consonant?","If a women gives birth to a baby and doesn't attempt to properly identify and inform the father should it be considered criminal?","Do you often feel sadness about your gender because of how it is perceived by others?","Would you rather be 6’8” or 5’?","Do you find it irritating when gender based polls don't have a non-binary\/other option?","Do you think receiving any kind of unsolicited nude pics would be ok, so long as the person was attractive?","According to you, is crying a sign of weakness?","Have you been sexually assaulted?","Would you take $50,000 to never have sex again for the rest of your life?","do you own a pink shirt?","Can you withstand the spice level of Flamin’ hot Cheetos for the whole bag?","Do you piss on the toilet seat?","Do you believe in zodiac signs?","Do you have food allergies?","Do you moan during sex?","Should there be a seperate men and women gym?","How do you feel about eating ass?","Do you think there will ever be a matriarchal society in a large scale?","What applied to you when in school ?","Are you taller or shorter than 5’8 (173 cm)?","Lets say someone is transgender and is dating someone of their original gender, are the homosexual?","Have you ever bullied someone?","Do you feel that you are expected to have children?","How important is smelling good for first impressions?","Would it hurt you more if you found out your partner slept with someone else, or if they were in love with someone else?","Would you like to turn into the opposite gender?","Do you know what a period panty is?","Cross necklaces (mostly) are hot, do you agree?","If you found out your partner of 14 years never was in love with you, would you stay in the relationship?","Which do you prefer for your primary care physician?","Cross your heart and hope to die.. Would you cheat with a 10 if there was 0% chance of anybody ever knowing?","Just curious about what y’all think about this, I know it was a pretty big deal awhile back.","Do you know on which day Valentine's Day is?","Are you in a relationship?","If you're depressed, you're not ready for a relationship. Agree or disagree?","Should plus size clothes cost more since it takes more material to make?","Which is more painful?,","Do you consider dirty jokes that make you uncomfortable to be sexual harrassment?","Do you prefer an older or younger partner?","Straight people, if a gay guy or a lesbian found you attractive, would you take that as a compliment\/would it make you feel good about yourself?","What gender of musician do you listen to more?","Would you sleep with a married person?","who do you appreciate compliments from more?","Do you enjoy sucking dick?","In an ideal relationship, would you rather be the breadwinner or the homemaker?","Drive with one or both hands?","How tall are you honestly?","Do you belief feminism and the women's rights movement as a whole was a good thing?","Who do you think is most nervous on a first date?","Who do you think cheat more, men or women?","Are the colors in the picture different?","Do you have long hair? (Head length or below)","if there is such a thing as reincarnation, would you choose to be...","What platform do you use for videos 10 minutes or less according to gender?","Do you feel safe while walking alone in the streets at night?","Have you ever been to therapy before?","Do you believe in Astrology\/star signs?","Do you consider men who eat plant-based meat less manly?","Opinion about false nails or nail polish","Can you do a pull-up?","If you were about to have a child, would you prefer to have a daughter or a son ?","Which of your parents has better taste in music?","Is it true that in order to be attractive, a man doesn't need to get muscular\/athletic, he just needs to have low body fat?","Have you cuddled with a pillow, or similar soft object, more than once after turning 15?","Do you find tattoos on women sexy?","Have you ever worn the same outfit 2 times in a row with the same group of people?","This is a poll to see which gender is more horny. Please answer this question truthfully?","Have you ever peed on a bush\/tree\/grass?","Does being raped count as losing your virginity?","Have you gotten surgery?","In my culture, aunts no matter their age are referred to as either \"old grandma (husband's first name)\" if shes older than the other aunts, or if she's younger, she'd be \"sister (husband's first name).\" Do you think that's weird?","Would you rather be shorter or taller?","Do you have any friends you are not in love with from the gender you are attracted to?","Is it sad to own a sex doll?","Are you or not a Woman?","how horny of a person are you","Do you like a clean shaven or a beard?","Did\/do you have an abusive and aggressive father?","Do you wash your legs or just kinda let water run on them?","Is wearing the same clothes everyday embarrassing?","Do ypu think it is okay for old women to be attracted to young but legal boys or no?","Have you ever been attracted to of the same gender as you?","People of which gender(preferred one) do you feel most comfortable AROUND WITH, especially about personal issues?","Straight people, in your relationship, are you dominate or submissive?","Cage Match! Who do you want to be in a boxing match?","What type of razor do you use? 🪒","Gamers, have you played a dating game?","Should it be illegal to fire someone because they have an Onlyfans?","What describes the best of your sex experience?","Do you have tattoos and\/or piercings?","Is creativity one of the things you find attractive?","What sex would you prefer as your doctor\/nurse\/dentist?","Are you part of the LGBTQ+ Community?","How often do you wear a hat when you are in public?","How do you feel about male strippers at bachelorette parties?","Is calling a Woman ugly bodyshaming them?","(for the adults) Date someone who always looks like 12 or someone who always looks like 80?","Have you ever fallen in love?","Would you say your at least a 8\/10?","Should there be some female only gyms so women can have their own safe space? (Not all gyms will be sex-segregated obviously but just a small few male only and female only gyms)","How much do you care about your partners body count?","Have you ever been catcalled in public?","Can you tie a tie, without help?","Should women shave their body hair?","Do you find Zendaya atrctive?","How long does it take you to poop?","What are your economic beliefs?","Are you straight? (sexuality)","Do you believe in horoscopes?","Should cheating be a punishable crime?","Do you play Minecraft?(just asking)","Is your partner older or younger than you?","Would you consider dating a co-worker?","Would prefer to have ongoing therapy with a female or male therapist?","how do you feel about people's sexuality?","Are you depressed or struggling with a mental illness?","Do you watch porn? (interested in male Vs female data).","Do you often wear makeup?","Have you ever contemplated suicide?","Have you ever gotten your eyebrows plucked, trimmed, etc?","If you're unmarried do you want to change your last name to your partners when\/if you get married?","Do you care about your hair going gray?","do you want children?","Is crossing your legs feminine ?","Big spoon or little spoon?","Ladies and gentlemen who gotta pay on (first) dates?","Have you changed so much in looks\/personality that some people didnt recognize you before you introduced yourself?","Do you think a class in high school on how to escape dangerous situations (like locked in room, tied up, kidnapped, etc) is a good idea?","Which scenario would be more chaotic?","Would you rather give birth or get appendicitis?","do you find pubes sexy on the other sex?","Do you think you would enjoy life more living your life as the opposite gender as you are right now?","Would you go bald for 100 dollars?","Is it rude to tell someone that they look better without makeup? Updated","Do you own any sex toy?","Have you ever showed your belly button at school?","are you mentally ill?","When you need to do both, poop or pee first?","Given the choice, which sex do you usually select for your character in video games?","Someone (not a stranger) hits you up out of nowhere and offers to give you head. You down?","Who has it tougher?","Do you currently feel depressed?","What do you prefer, Doritos or Pringles?","do you shave your ass crack?","Were you sexually harassed in middle school or high school (in a school setting prior to university\/college)?","How should men keep their pubes?","Are you still a virgin?","Do prefer having a bath or a shower?","Do you prefer to have a Son or Daughter?","Do you have a fiber-related hobby?","Do you believe all girls have cooties?","Do women have it worse than men?","Do you believe women in the West are oppressed?","Who Do You Think Is More Shallow?","If someone had a personality that you liked and a lot of money but still living with their parents at 30, would that stop you from dating them?","Have you sucked dick? If you haven’t, would you?","Is having no social life a red flag for you ?","Do you believe that some people’s periods sync?","Do you think women's self defense actually works?","Are you happy in life?","Is it unethical to marry someone for their money?","In first world countries, who (generally speaking) has it harder in life?","To people with which hair color are you more attracted?","Do you like polls where the options are divided based on gender?","Do you make I hate my partner 'jokes' or have that sort of sense of humour?","Are you afraid of the opposite gender?","Is it weird for a grown man to watch Frozen 3 in theaters by himself?","Who should pay on dates","What is your honest opinion on women wearing long fake nails?","Would you date someone who is bisexual?","How do you prefer your sexual partner’s pubic hair?","Would you like makeup becoming a norm for men to wear ?","Do you have a driving license or no?","If your government would decide to build men only city, would you support it?","Have you ever taken a nude-selfie?","Which gender is funnier?","Blue or pink colour stereotypes","Do you sometimes wish you were the opposite gender?","What addiction do you have?","You are offered a kiss from a very attractive stranger of the gender you are attracted to, noone is watching, do you take it?","Do you think divorce laws are biased in women’s favor and against men? Should that change?","Who do you thinks cheats more on their partners?","Would you be willing to date someone who worked as a prostitute?","If you had a one night stand that resulted in a pregnancy, what would you want to do about it?","Would you consider yourself stereotypical?","Do tattoos make someone more or less attractive?","Can men and women be just friends ?","Have you ever considered suicide?","Do you shave your arms?","Do you want your partner to spank you for disobedience or stepping out of line?","If you were home alone and it wasn't too cold in your house, would you walk around naked? if so, why?","Would you rather live in a matriarchal society or a patriarchal society?","Would you care to be pretty in a world you live in alone?","Do want your partner to be as smart as you?","Do you have a skincare routine?","Do you secretly find criminals kind of hot because they are dangerous?","Would you like to be taller, shorter or remain your current height? (by gender)","Are you more Dom or Sub in bed ?","Are you taller or shorter than 5’6” (168 cm)?","Would you agree to have the Kardashians to be your personal assistants?","Do you feel the same way about \"not like other boys\" as you do about \"not like other girls\"?","Do you regularly masturbate?","Would you go alone to a concert?","Would your SO not wanting children affect your relationship?","What do you discuss most with your same sex friends?","Have you ever had a neighbor that watches you constantly?","Where do you normally wear your pants?","Does rape culture exist in the US?","Would you rather date someone with a beautiful face and an ugly body, or someone with an ugly face and a beautiful body?","When you're making your final decision, do you tend to follow your heart or your mind?","Do you wash your asshole in the shower?","Have you ever in your life felt “skinny enough?”","Which of these races are you the most attracted to?","do you wear makeup ?","Is your index finger longer than your ring finger?","Straight people, would you prefer to receive terrible oral from the opposite gender, or amazing oral from the same gender?","Considering all aspects of civil modern life in a civil modern society, are women just as strong and capable as men?","Have you been sexually harassed?","Can you masturbate to inanimate nsfw pictures?","What kind of career are you more inclined towards?","Do you enjoy shopping for clothes?","Dо yоu feel sосietal рressure tо hаve сhildren?","Does the wage gap between men and women exist? (Read before voting)","What body to you prefer for a man to have?","Do you think you could win a boxing fight against Mike Tyson, but he’s deaf and blind?","Would you rather be short surrounded by tall people, or tall surrounded by short people?","Do you want to have kids in the future?","How often do people not believe you when you say \"no\" to something?","Would you marry Link (BOTW)?","Do you find fat women attractive?","If women were stronger then men, then do you think there would be as much FEMALE on MALE crime as there is MALE on FEMALE crime today?","Have you ever been a victim of sexual assault?","Would you marry to a copy of yourself ?","Dear Reddit user! Which genre do you prefer more; sci-fi or detective?","Do you care about ancestry in a marriage(slave,nobility,royalty etc.)?","Would you switch your gender if you could?","Do you sleep with a stuffed animal?","Did you write notes in class?","Do you consider yourself a ‘History Buff’?","How do you do it? (Link Below)","Do you think women are worse drivers than men ?","Do you think it’s better to have many friends or few close friends?","Do you moisturise your hands?","Which would you rather be?","Agree or disagree: most anime are made\/targeted for males","Do you think it's fine for a man to walk away from his unborn child, the foetus, because he never wanted it?","Do you pee standing up, or sitting down?","Are you asexual?","How often do you get complimented by people outside your family?","Do you think men who regularly use Reddit make for better or worse husbands than those who don't?","In general, do women look better with or without makeup?","Do you close your blinds as soon as the sun goes down and it’s dark outside?","Do you know how to change a tire?","Should men’s bathrooms have baby changing stations?","Who has more freedom in clothing?","Do you have a skin care routine?","Would you prefer everyone regardless of their gender to have short hair or long hair?","who do you prefer getting hugged by?","Have you sucked a dick?","Who do you think is the prize?","Do you wash your hands when you go pee?","You are going to be reincarnated in a first world country. You won't remember your past life, and you're just trying to ensure the best life for your future self. Which sex would you choose? (Current Sex is in Parentheses)","18+ people of Reddit, do you sleep with a stuffed animal\/toy?","Do you feel genuine affection for all or some of your stuffed animals?","Which is worse in your opinion?","Is there a point in dating someone if you're 99% sure it won't go the distance?","Do you shave your armpits?","Do you think you are physically stronger than your parent of the same gender as you?","How do you pee? (squatting = deep squat but you stay in the lowest position)","If a person who is not your partner\/spouse calls you 'hot' or 'sexy' do you take it as...?","My regular shower usually takes?","Do you like circus peanuts?","Do you find it unattractive when someone is desperate to please you and afraid of losing you?","Do you like getting asked out?","Do you prefer older or younger romantic partners?","Which type of Sex do you like more?","Should rapid weight gain be considered grounds for a divorce?","Males of reddit. Do you find getting a blowjob weird?","Are you attracted to people with well done\/placed tattoos?","Is being overweight a dealbreaker for you when dating?","Do Women have it easier in finding love\/sex?","Would you make love to a woman?","Are there ANY circumstances where cheating would be considered okay?","Has any of this happened to you?","How frequently do you go out of the house?","Which of these are the most Harmful?","do you shave your butthole?","Have you played any Animal Crossing game?","Is there or has there ever been sexual tension between you and your best friend?","Have you had your menstrual cycle this month?","do you use conditioner?","Is it wrong to give a girl compliments on her body?","have you ever gotten an unsolicited D pic?","Would you date a cop?","Have you cried to a movie\/song?","Would you be sad about being infertile?","If you had to choose one, would you rather kill or be killed?","Would you rather be a masculine woman or a feminine man?","Do you think using hand sanitizer instead of physically washing your hands does the same thing?","Do you judge a person by how they look?","How tall do you prefer your partner to be?","Have you peed outside within recent memory?","Do you play 8 ball pool?","How likely are you to remember a compliment?","In a relationship (whether you’re actually in one or not) do you want to be the dominant one of the submissive one? (Non-sexual question)","Which gender is easier to raise?","Is ghosting someone, assuming they did nothing wrong, a fair way to reject them?","Do you regularly enjoy true crime stories\/documentaries?","Have you ever own a diary?","If someone you've never seen before came up to you and asked for your number, would you give it to him\/her (whichever you're attracted to)?","Have you ever fully read a fan fiction story?","Have you ever felt like a pervert?","Do you shave your legs?","Does your country have a law that can oblige YOU to do military service in case of defense?","Do you have a friend, who you honestly believe is stupid?","male genitals, prefer circumcised or uncircumcised?","What height gap do you think a physically ideal straight couple should have?","Do you wish it was always totally normal and acceptable for both genders to be shirtless anytime, anywhere & for it not to be sexualized?","Do you own a sex toy?","Do you think society treats men as expendable\/disposable?","Is it easier to find a meaningful significant other as a guy or girl?","A question for straight people only, have you ever initiated sex?","Would you commit a crime if you had a 100% chance of getting away with it?","Which role best describes you?","Do you think it’s okay to date your friend’s ex ?","Is it ok to say no to watching Christmas movies with your girlfriend?","Bisexual redditors, do you enjoy sex more with men or women?","Do you think that Roe vs. Wade should be overturned?","Would you get angry if you discovered your partner masturbates and watches porn?","What’s more attractive people with or without glasses?","The spouse of your dreams wants to sign a prenup to protect all of his valuable assets and ensure the marriage is purely based off love, what is your response?","Do you think men with long hair look generally good or bad?","Do you have a preference as to whether or not your date has on perfume or cologne?","does \"your old haircut looked better\" sound offensive?","Can you do one pull-up?","Would you be weirded out if you find out your partner was obsessed with you before you were in a relationship, saving and keeping your photos on their phone and whatever?","What do you generally like more: female voices or male voices?","Have you ever had to pee on the highway?","What height do you prefer your partner to be?","Girls of Reddit, would you be offended if, right after birth, your SO wanted a paternity test, would you be offended?","do you think women should have the right to be fully topless freely like men?","Have you ever been completely bald?","What do you wear to sleep?","Do you think it’s okay to pee in a public park late at night?","Which gender do you think has it easier in life?","Which type are you attracted to?","At a masseuse, \"undress to your level of comfort\" means...?","Do you trust in the \"Pull-Out\" Method?","Will you watch the UCL final?","Do you trim your nose hair?","Are you homosexual ?","Just for ppl who wear makeup, how long does it take u for wearing makeup?","Do you know someone who has committed suicide?","someone walks in on you naked, what do you cover? (you have two choices)","Compared to you, how tall do you prefer your significant other to be?","How long is the hair on your head?","What is your political affiliation?","if you've ever played the Sims in the \"intended\" (as a life sim) do you ever spend time making platonic friends?","Would you rather live in a world with:","(Better version of question asked earlier) Should women be drafted assuming theres no way out of it?","should a man who is accused of sexual assault be presumed innocent until proven guilty?","would you do the deed with your sibling for $1 billion? money will be split in half.","Do you masturbate?","Have you been affected by toxic beauty standards?","Have you broken a bone","Would you become a very well known pornstar if it meant you will be earning 500k per year?","Can you accurately fake an orgasm?","Sexually, are you a sub or dom?","True or false, no one cleans a house faster than a single guy expecting to have a girl over later?","Do you think life is easier for men or women?","Have you ever sent nudes of yourself (consensually)?","If You got to start life again which gender would you chose.","If it came to it, would you die for your SO?","If the world was ending would you show me your boobs?","Would the world be a better place if there was only one sex?","People of Reddit, do you wear makeup?","Are women still oppressed?","Do you believe that posts that ask for gender should atleast have an other option for people that arent male or female","Have you ever gone commando?","Would you shave your head bald for USD$5000?","You see a card on your hotel room desk. It reads: Massage $25.00 - No Sexy \/ Massage $50.00 - With Sexy.","How do you sleep????","with women singing, do you prefer higher or lower pitched voices?","What are your opinions on L-G-B-T people?","Would women do a superior job at managing the world?","Do you cry often (at least 2-3 times a week)?","Should men pay the full bill for first dates?","Do you think matriarchy would be as bad or worse for men as patriarchy is for women?","Which is more attractive to you; a guy with feminine features, or a girl with masculine features?","What is your net feeling when you hear the terms \"Manosphere\" and \"Red Pill\"?","to those that believe in marriage, you plan to do what with your last name?","Would you agree to shortening your lifespan by 10 years (let's say from 75 to 65) in exchange for your dream body?","Those of you who don't have kids yet, would you rather a boy or a girl?","Do you know when someone is flirting\/is interested in you?","What will happen if you fight your bf\/gf?","Do you want it to be more common for guys to wear skirts? If so, by how much?","Were you bullied at school?","Would you want to see a list of everyone who ever thought about you while masturbating?","do you want to have biological kids?","Is it better for a man to ask a woman for her phone number or just give her his business card?","What is your opinion on feminism?","Have you ever tried to deepthroat a banana\/popsicle\/cucumber\/anything with a suggestive shape?","Have you ever shoplifted?","Do you personally find unibrows attractive?","would you rather date ?","If you had to choose, would you rather have a son or a daughter?","What is your political affiliation and gender?","Have you ever been ghosted by a potential date?","Redditors are you more submissive or dominant?","Have you ever been cheated on?","Do you find facial scars attractive??","Which gender related problems would you rather have?","Do you find forming friendships with the opposite gender a bit harder than forming friendships with people of your gender?","Which gender do you think is funnier?","What sex do you want your child\/first child to be?","should men shave their body hair?","Do you like to be big spoon or small spoon when cuddling?","would you rather gain or lose 2 in. (5 cm) in height?","Is getting kicked in the balls worse than period pains?","Do you own a sextoy?","If you were in a marriage with the traditional breadwinner-homemaker dynamic, which would you rather be?","are femboys attractive?","Do you usually part your hair, and if so, which way do you part it?","Which gender do you think is more picky when selecting a partner?","Do you use skincare?","Can you wrap your thumb and middle finger around your wrist until they touch?","You go to school one day, thinking everything is normal, but once you go, you realize that everyone, even the teachers, is naked. This wasn’t planned, and you showed up to school in sweats. Are you embarrassed to be the only on is clothes?","Should sending unsolicited nudes be illegal?","Do you know about the \"Pink Tax\"?","Do you like wearing dresses or tuxedos?","Have you ever done the dishes by hand?","have you ever had an eating disorder? (any type)","Is it wrong for women to poop?","How much pubic hair do you prefer in a partner?","Big or little spoon?","How often do you think about your any of your exes?","Which of these sunglasses do you think looks better? (click to see picture).","Would you date someone taller than you?","Would the world be more or less peaceful if males had their balls chopped off at a certain age? once you're finished with your reproductive cycle? lol. and I'm a guy so not hating on anyone.","Do you have a New Year's Resolution?","Do you think you have neat handwriting?","Non-Asian people: can you cook Asian food?","Have you been diagnosed with a mental illness\/disorder?","Do you have anorexia?","If you got cat-called by a random group of people, do you think you would be offended?","Do you see tattoos can make your sex partner more sexually attractive or arousing?","Do you use shampoo or conditioner more often?","Would you rather prefer your girlfriend\/boyfriend\/spouse to be physically stronger than you or weaker than you?","Are women marginalised in your opinion?","Which finger is longer?","How would you react if your S\/O said \"pog\" after sex? (Positive would be smiling\/laughing etc. Negative would be actively turned off, disgusted, etc.)","Do you read romance books?","If you weren't judged for it, how would you want to dress?","You are stranded on an island with a beautiful Mermaid\/Merman. Which half do you want to be human?","Do you feel safe walking around your neighborhood in the middle of the night?","Short or Taller then you?","out of pure curiosity, do you like spicy food ?","Do you play video games?","Do men or women have a worse overall dating experience?","Is it weird to have a cat\/dog in the room with you when you go to the bathroom?","What height would you prefer your spouse to be compared to you?","How often do you shave your legs?","When you jump into a pool, do you plug your nose?","Should men wearing feminine clothing be normalized?","Are men generally funnier than women?","How does being bald affect how attractive someone is?","Single Adults of Reddit; Does online dating..","What are you on a dating app for?","Would you rather die before or after your SO?","Has a stranger ever flirted and asked for your number in public?","When was the last time you got a hug?","Are men lonelier than women?","Did you ever skip class in school?"],"1":["Do you want to have kids?"],"2":["Do you believe in ghosts?"],"3":["Have you ever been sexually harassed?","What are you on the political spectrum?","What do you do with your pubes?","Have you ever received an unwanted nude?","If they made death row inmates fight to the dead in a gladiator style fight would you watch it?","Which do you think is more harmful for your brain?","Are you afraid of dark streets\/parks at night alone?","Should people shave their (disgusting) body hair?","Should Women be required to register for selective service along with Men when they turn 18? (Assuming the government will NEVER want to abolish it so we cannot protest to remove it)","Is it okay for mother’s to breastfeed their child in public (eg: Middle of store where everyone can look)","Did you listen to music when while sleeping?","How often do you get compliments from old men (strangers)?","How do you leave the toilet seat when you are done using it?","How do you walk?","Do you wear makeup to the gym?","Are you thinking a lot about what other people think about you?","Does bathroom humor make you uncomfortable?","Would you rather be attractive but socially awkward or ugly but charismatic?","Would you rather have sex with a 23 year old of same sex than an 85 year old of the opposite sex?","If you had to choose would you prefere to have your Dream Job or True Love?","Do you shave your armpits?","Do you find body hair on women gross?","Do you still wear protection if a your (short term) partner is on birth control?","Women or men of reddit, who do you where your make up for?","My girlfriend\/boyfriend got to be[...] than me","Would the world be a better place without makeup?","Which personality is more effective at getting women to first be attracted to you?","Which birthday present would you rather get?"],"4":["Do you drink alcohol?"],"5":["Have you ever been to therapy before?","how do you pee most of the time? (answer honestly)","Do you go to the gym?","Has anyone ever slapped your butt?","Have you ever fully read a fan fiction story?","Who typically has higher standards about potential partners for dating?","Is shopping a chore?","Would you be embarrassed to cry in public?","Would you have any problems dating someone who owned an assault rifle?","Do you believe gender is a social construct?","do you wash your butthole in the shower?","Do you like the color red?","Are you part of the LGBTQIA+?","Do you agree with traditional gender roles?","Would you choose to wake up the opposite gender?","Would you date someone doing only fans","Are you annoyed when a poll include only male and female with no “other” option for non-binary","Do you concider yourself a feminist\/support feminism (that doesn't mean you support every feminist or every feminist movement)?","Have you ever declined a date with someone because you knew they were to good for you?","If you could change the gender given to you at birth, would you?","Do you like pubes on your partner?"],"6":["Do you want to have kids?"],"7":["Do you want to have kids?"],"8":["Do you shave your armpits?"],"9":["Do you drink alcohol?"],"10":["how do you pee most of the time? (answer honestly)","Do you go to the gym?","Has anyone ever slapped your butt?","Is it weird to have stuffed animals as an adult?","Would you be willing to change your last name if you got married?","Have you ever dated someone you weren’t initially attracted to?","Would you be embarrassed to cry in public?","Do you know what discharge is?","Do you believe gender is a social construct?","Do you shave your legs?","Have you ever experienced sexual harassment?","do you wash your butthole in the shower?","Do you like the color red?","Are you part of the LGBTQIA+?","Would you choose to wake up the opposite gender?","Would you date someone doing only fans","Do you shave your armpits?","Are you annoyed when a poll include only male and female with no “other” option for non-binary","Do you trim your nose hair?","If you could change the gender given to you at birth, would you?","Do you like pubes on your partner?"],"11":["Did you have to wear school uniform in high school?","Would you like to change the SI unit of length to Bananas","Does having children recite the Pledge of Allegiance feel cultish to you?","Americans and Non Americans, do you know how to drive with manual transmission?","Do you call it “soccer” or “football”?","In your opinion, when is it ok to joke\/meme about 9\/11?","Is America the best country in the world?","Do you care about United States politics?","Had you ever heard of Joe Biden before he ran for US president?","On which day does the week start?","America bad or not??","Do you get drunk at least once a month?","Is America a country or a continent?","Is America a free country?","Overall do you have a favourable view of the police in your country?","Should The United States Have Grade Schools Teach Native American History?","If your home country was invaded would you take up arms and join the military?","Do you floss your teeth?","Have you ever lied on a Reddit poll just to make the other side look bad?","Do people in western countries still use greeting cards?","Is America the greatest country in the world?","Did you watch El Clasico (football match between Real Madrid and Barcelona) yesterday?","What do you consider an “old” house?","Which unit of temperature do you use?","are Americans good at geography?","Which is more famous?","Do you celebrate Halloween in some way?","Assuming ZERO nukes - As things stand, could America and its allies win a WW3?","Do you know what GOP stands for (as in US politics)?","Do you know any friends\/family that died from a car related accident?","Which is better, Fahrenheit or Celsius?","Historically speaking, how did the United States affect the world?","Has a student ever died at your school?","Do you trust the police?","Have you ever used a gun?","Do you assume most other redditors are of the same nationality as you?","Do you have any political views that you are afraid to share?","How do you pronounce ‘Z’?","Which of these 3 countries would you rather live in?","Do you dislike California?","How do you call \"football\"?","How many countries have you been to?","Should circumcision be illegal? (not including for medical reasons)","Do you know the American pledge of allegiance?","What is your opinion on the united states?","Did your high school have cops walking the school?","Do you believe the states in the US are more culturally varied than countries in Europe?","do you own an electric kettle?","Would you rather receive 1,000 US dollars or 100,000 of a random country's currency?","Is the Democratic Party left wing?","do you know bud spencer and terence hill?","Do the words “liberal” and “leftist” mean close to the same thing?","Which is the correct spelling?","Do you want to own a gun?","Should normal people be allowed to own firearms?","Do you think America has culture?","Do you care about US politics ?","Do you think the United States really need that much military?","In America you can legally get a gun before you can legally drink alcohol. Do you think that should be the other way around?","Is the vaccine safe?","Who was the better U.S. president, George Washington or Abraham Lincoln?","Without googling, do you know who Maggie Smith is?","Do you own a credit card?","Would the U.K. have been successfully invaded in ww2 if USA did not join?","Would you rather live in a random European country or random US state?","What is the correct way to pronounce the H in “herbs”?","Do you believe that the US would benefit from a parliamentary system?","Do you know the lyrics for the star spangled banner?","Do you know what Ultimate (sport) is ?","would you be able to name all 50 US states","Do you watch New Year’s Eve Drop Ball on Live TV?","How do you call the game with this ball: ⚽️ ?","Have you ever been to the Midwest of the US?","Do you know how many seats are in the United States Senate?","Do you think the deployment of soldiers in Afghanistan as a reaction to the terroristic attacks on 9\/11 was justified sufficiently?","Overall do you have a favorable view or unfavorable view of the Republican Party in the United States?","How much attention do you pay to news from other countries?","Do you celebrate halloween?","Is the United States a unique country?","Have you ever heard of the Sandy Hook Shooting (aka Newtown, CT) Shooting?","Can you name all of the countries in South America?","Which sport is better?","Does America have a Gun Problem?","Which measurement system do you think is better?","Do you think calling your parents ma'am\/sir is normal?","Do you wear shoes at home?","Can you name all 50 American States?","Do you know what gerrymandering is?","Can you name all the continents and oceans of the world?","Do you tip someone who robbed you just because they did an incredible job?","How many american states can you name?","When you make a poll, do you assume that most or all of those who answer it are from your country?","Do you know who the impractical jokers are?","Would it be okay if the U.S. gives up its position as being the most powerful country in the world?","Before 2020, was the US a generally good or bad country?","Do you watch American football?","Which way politically leaning is reddit?","At the least, should the US raise the minimum age to purchase a firearm to 21?","Should the U.S.A change their paper currency to more secure\/sturdier design and material?","Do you know where Long Island is?","What pizza do you think is best?","Should Puerto Rico 🇵🇷 be a U.S. state?","Have you ever fired a gun before?","Have you ever fired a real gun before?","Is your Phone setted to....?","Should cashiers in America have chairs to sit down in?","Would you be willing to protect your country in the case of an invasion?","Do you think healthcare should be free \/ paid for by taxes?","Do you think the US has done more good or bad for\/in the world overall in the last 100 years?","Are you circumcised?","Do you care about your ancestral heritage?","which way is better?","Do you support communism?","Should the US give Alaska to Canada?","how do you say caramel?","Would you spend 1 year in prison for 10 years worth of your salary?","Is it ok to women to wear a sweatshirt without a bra in public?","Is your \"daily driven\" car manual? (Not asking if you know how to drive manual or not)","Without looking it up, is there an ongoing civil war in Algeria 🇩🇿?","Would you pass the U.S citizenship test if you had to take it right now?","Should Americans switch to Celsius instead of Fahrenheit?","Thoughts on living in the US?","Can you support conservation and also be a hunter?","Do you think the United States of America would be a better place to live in today if it had never gained independence from Great Britain?","Can you fluently speak any foreign language?","In polls with units, which should be used?","Do you take your shoes off before entering a home?","Do you think allowing citizens to own guns makes life more or less safe?","Do you think people who born in America is lucky?","Do you use uncle\/aunt to refer to your parent’s sibling’s spouse?","Do you know how to read the 24 hour clock? (or military time)","Will you be watching the presidential debates?","How many non-native languages do you know?","What are your views about the United States of America?","Do you think the police should be abolished completely?","Do you say football\/soccer?","Do you wear shoes indoors in your own or someone else's house?","Does the U.S. have the greatest economy in the world?","Is police a problem in your country?","People of Reddit, would you like to live in America?","What’s your opinion of the Police?","Are you monolingual or not?","Which ones more famous?","Have you ever been to an open casket funeral?","Which word do you use to mean \"causes addiction\"?","Do you think the American Dream exists? (Or existed but no longer does)","Is America Overrated?","In general, do you respect police officers?","Are you content with the political situation of where you live?","Do you think being very patriotic is a good or bad thing?","Do you say “dude” in everyday conversation?","Do you know the USA pledge of allegiance?","Do you think there’s such a thing as an “American accent”?","Is it morally wrong not to tip a waiter\/delivery driver? Why or why not?","Which of this 2 big american political parties would you rather vote if you had to choose?","Should the age to vote be reduced to 16?","You get 1 billion dollars but America becomes communist, do you take the 1 billion dollars?","Without looking it up, do you know exactly how many centimeters are in an inch?","Is right to bear arms a human right?","Do you think that more than 50% of Reddit users are Americans?","Do you think that liberals are left-wing?","What Order Of Operations Method did you learn for math?","Do you think the United States itself could feed the world?","What are your thoughts on America's gun laws?","Have you used a gun before ?","Do you think the aftermath of the U.S. midterm elections will be dramatic enough that the Turkey Pardoning will be cancelled?","Is American (not southern) the most monotone boring accent?","Do you know anyone who identifies as \"English American\"?","Should the USA switch to the metric system?","Do you know how to play baseball?","Do you believe in climat change ?","Should the US send $40 billion to Ukraine?","How do you pronounce the word ‘notification’","do you know what the pachamama is?","Did you have to read 1984 in your school?","Should Mickey Mouse Become President Of The United States Of America?","Do you know the name of the current president of United States?","Do you use metric measurement in your everyday life outside of work? Targeted to Americans.","which messaging app do you use more?","Which country is a nicer place to live?","Have you ever worked in retail?","Based on the present, will America affect the world more positively or negatively in the future?","Have you ever daydreamed about winning the lottery so you could spend money on medical care?","Is the state of America as bad as reddit would have you believe?","Which is superior, metric or imperial?","Have you or somebody you know had \/ has cancer?","Do you have a firearm in your household?","Did you ever know someone who committed suicide?","Are you tired of hearing about American politics?","Is owning a gun a privilege or a right?","Do you wear sneakers\/outside shoes indoors?","Should it be a legal requirement for cashiers to be able to sit while at work?","Which phrase do you use to mean \"not deliberately\"?","US vs Europe: Who would win in a war?","Are beans a breakfast food?","do you know who Chester Arthur is?","Is driving a necessity\/essential or a privilege\/luxury?","In your opinion, who was more historically significant on a global scale?","Are you supportive of American intervention in the Russia-Ukraine conflict?","When you start a new job(or school) do you make a plan of action incase of a mass shooting event there?","Do you like what is commonly called \"American cheese\"?","Would you push a button where every government turned into a monarchy?","Do you know any of these US ski resorts: Vail, Aspen, Telluride, Breckenridge, Arapahoe Basin?","Do you care about U.S. politics?","Have you ever fired a gun?","Do you know who Jimmy Carter is?","Would you live in america?","Is the US the “good guy” in world affairs?","Should citizen be allowed to have\/carry firearm?","Is housing a “human right”?","Did you ever have tornado drills in school?","Have you ever been grounded by your parents?","Do you consider Fruit-Snacks \/ Gummies candy?","Do you have any idea how American \"football\" works?","I’ve talked to a lot of Americans and most haven’t been to a foreign country, have you?","Seeing how common horrible school shootings are in the US do you think gun laws should change?","Has the current state of the Economy affected you?","Do you tip restaurant workers?","Are you watch Puppy Bowl XVII on TV?","Should gun ownership be legal?","What kind of an impression do you generally get when you find out someone has done psychedelics for recreational purposes?","Do you know what bluegrass is?","What are your thoughts on American football?","Do you own a kettle?","Do you think america should make owning a gun illegal?","Is assimilating the world to the US society a good thing?","Is having guns a right?","If someone said that they were Irish, do you expect them to be from Ireland, or just genetically Irish?","I want to see what proportion of people on this sub are American. Are you American?","Have you ever had a health problem but avoided going to the hospital due to it being too expensive?","Do you actually like american football?","Do you prefer expressing temperature In Fahrenheit or Celsius?","Should there be strict gun control laws?","Does it snow in the very south of South America?","People from around the world, answer me this, how many continents are there?","If you could press a button that would magically give the US a universal healthcare system, would you do it?","Do you regularly use whatsapp?","Is air conditioning in houses\/apartments unnecesary in most cases?","How do you spell \"40\" as a word?","Can you point to kaliningrad on an empty map? read all options","Dog owners, do you let your dog sleep in your bed?","Did you commemorate 9\/11 and why\/why not?","does America get hated on too much?","Do you know who Warren Buffet is?","Do you refrigerate your eggs?","Do you think confederate statues should be torn down?","How many U.S states can you name?","How do you pronounce the word 'Route'?","Have you ever seen a tornado in person?","Should the legal drinking age be lowered to 18 in America?","Do you answer phone calls where you don't recognize the number?","Have you got an ad to vote for the US elections?","How many US states can you name using the quiz in the link?","Can you name most\/all of the following? If you cannot name most\/all, don't vote.","Do you think guns make life safer or more dangerous?","Without looking it up, do you know how long an american president's term is?","How do you feel about Bacon?","Do you or somebody you know own a gun?","Do you floss at least most days?","Which sport is more interesting to watch?","Which of these systems do you prefer?","Who do you think invented the fist car?","Do you own any guns?","If someone tries to rob you with a weapon, do they forfeit their right to live?","Should American citizens receive full free healthcare and education services in Europe as a thank you for saving them in two world wars, and protecting them now?","Should the USA abolish the second amendment? Why or why not?","You hear gunshots at 2 AM, what do you do?","What do you prefer??","Do you believe President Biden is handling the border crisis well?","Quick, without checking, where is Martha's Vineyard?","Are you interested in Soccer\/Football?","When someone on the internet asks you where you live, what do you say?","How do you pronounce “route”?","Do you know what rights the fourth ammendment grants you?","Were you physically disciplined as a child? (spanked, beaten, forced to eat soap, etc.)","Do u think George Bush was responsible for the deaths of 1 million Iraqis?","Did you have an annual lice check in elementary school?","Do you microwave water to make hot tea?","Do you think Trump was a good president? (American\/non-American edition)","Is USA the most important\/relevant country in the world?","Are you scared of the police in your country?","Is 6 dollars a good price for a family size pizza ?","True or False?: American currency has a $2 dollar bill","Should the US switch to the metric unit system?","Do you think the subreddit r\/politics should actually be called r\/uspolitics?","Just want to see what people think about US geography. Which US state is the largest?","Do you personally know a Jew?","Do you know what Ding Dong Ditch is?","What's your opinion on American Football?","Should the United States change the cotton fiber bank notes to polymer bank notes?","Do you celebrate Thanks Giving?","Do you think America should revise their gun laws or whatever shit they have to stop this much gun violence?","Have you ever handled a Firearm?","Can you name all 46 US presidents in the order they served?","What do you call the country between Mexico and Canada?","Which number is larger?","You guys use WhatsApp?","What's your opinion of the police in your region?","Do \"father\" and \"bother\" rhyme?","Do you feel more loyalty to your town or your country?","Have you ever travelled outside of your native country?","Do you or someone you live with own a firearm?","what country do you live in?","Should the US have stricter gun control?","Do you believe in the right to bear arms?","Do you know who Tom Brady is?","Have you ever been to New York City?","Does America have a good healthcare system?","Which Georgia's your favorite?","Do you celebrate thanks giving?","Were Hiroshima and Nagasaki justified?","What's your opinion on root beer?","Should the US pull out and end the war in the middleast?","Do you know how to drive stick shift (manual)?","What do you say the MOST (temperature)","Should the 2nd amendment be repealed?","Do you own any cash in foreign currency?","Do you think America is a safe place to live?","In the US, is it unethical to donate to a political candidate in another state?","Would the US be a safer place if the second amendment was never written?","Is Reddit too US-centered?","Which is the best date format?","Is \"forgetting\" to connect your headphones and blasting embarassing music in the library funny?","Do you own a passport?","Do you dislike how 'everything' on Reddit assumes you're American?","What is\/was your opinion on the food that your school provided?","Do you say corona or covid?","Does your school have a uniform that is mandatory to wear?","What phone do you use?","Can \"pleading the fifth\" be considered as pretty much admitting to something?","Could the US military beat its own citizens in a war?","Have you ever visited Disney World in Orlando, Florida?","What do you call the back of a car where you can put luggage?","Do you tip your average elden ring boss?","Which base do you go to (read more)?","Which mathematical operation looks better?? (Part 2)","Do guns make society safer or more violent?","Has someone you know died as a result of a firearm?","Should the US make the change from the imperial system, to the metric system?","Should 21 be the legal drinking age?","Do you like American Cheese?","Which clock do you find easier to read?","Do you like the United States?","How well do you know US states?","Should the US return to Isolationism?","Do you usually store your eggs in the refrigerator?","Can America win a war against the rest of the world if nuclear weapon doesn't exist?","Do you own a firearm?","Have you ever been on a train (not like the ones at amusement parks, an actual train)?","Will you celebrate Halloween?","Do you think the United States is a good country to live in?","Would gun control benefit America? (As in the USA)","Are you watch Super Bowl LV on TV?","Have you read Percy Jackson?","What do you call an “!”?","Do\/did you like school?","What time format do you use?","Do you use\/Have you used WhatsApp?","As a child, were you required to buy large amounts of basic supplies (paper towels, tissues, etc.) for your school?","Do you think your country is progressive?","Have you joined to one of your regions' subreddit?","If given the task, could you label all 50 US states on a map?","How do you prepare most frozen\/Instant foods?","Could the United States have won the revolutionary war without France's help?","So you think pledging allegiance to the American flag every morning before class is stupid?","Should the U.S. increase or decrease its military budget?","Do you think that Americans are in general more easily offended than other people?","Have you heard of fried pickles?","Which of these vehicles were you most recently driving\/riding?","Do you use WhatsApp?","What's your gun ownership status?","To go really extreme, who would win in a war of the USA against the entierty of the world ?","Do you personally know anyone who owns a gun?","Do you like to eat cheese?","Should public health care be free in the US?","Why do you think English is the universal language in general and in the internet?","when you hear \"Georgia\" do you thing the Country or the US state?","As a kid did you ever have a \"snow day\"?","\"Color\" or \"Colour\"?","Do you prefer Farenheit, Celcius, or Kelvin?","If someone asks you how far away a place is, do you answer in time or distance?","Do you like America?","Is Canada a socialist country?","At what age is someone an Adult?","Will you watch the NFL?","have you ever been to walmart?","Women, would you perfer a partner that is or isn't circumsised?","Do you believe the American system is beyond being fixable currently and the only way to fix it is for a revolution to happen?","Should the US use the metric system","america good or bad and are you american?","Have you ever seen a real gun? (Does not include guns on cops or security)","Which word do you use to mean \"has lots of flavour\"?","If by pushing a button, you could make it so no car or truck in the US ever runs out of gasoline, would you push it?","What one do you say?","Without googling it, what is the capital of the state of New York?","Are you from America?","Are overall race relations in America better than they were ten years ago?","Do you use counter-clockwise or anti-clockwise?","When you have a nightmare, which death are you more likely to dream about?","Did you know that the United States House of Representatives has 435 members?","Did you know that President Joe Biden has a stutter?","Does American food taste over salted?","How do you get to school\/work?","In the past three years, have you been in a situation where you feared begin shot?","Is there a room in your home with carpeted floors?","What sport is better?","You have to eat one of these cuisines for the rest of your life. Which one would you choose?","Do you think American culture is bland in terms of traditions?","Have you ever seen a cop roll a stop sign\/disregard a stop sign?","What percent of Americans do you think are obese?","Do you think the AR-15 rifle should be banned from purchases by citizens?","Have you ever been to another country?","Do you use the word \"color\" or \"colour\"?","Have you ever shot a gun?","Do you know where Ontario is?","Do you think your country is the greatest to have ever existed?","Is America abusive to the rest of the world?","Is lack of gun control the single biggest factor in causing mass shootings?","Do you think US is the most scenic country in the world?","Are Americans too loving of their flag?","Do y'all use iPhone?","Do you know who Warren G. Harding was?","Have you ever been to Hawaii?","Do you think that people who think the USA is a good place to live are delusiona?","Do you think that Americans should have access to free healthcare?","What is your overall view of socialism?","Do you usually try to self-diagnose before going to the doctor?","Are Americans actually bad at geography?","How do you spell the element S?","Do you know who Stephen F. Austin is?","Have you ever been to California?","Being as objective as possible, which is better in terms of lifestyle, culture, food, landscapes, diversity, people and international reputation?"],"12":["Have you ever been to a sauna?","Do you think Europeans are smarter than Americans?","How many American states can you name?","Who would win in a war? (No nukes)","What time format do you use?","Have you experienced 100⁰F, or 37⁰C in the past 24 hours?","Are you tired of the USA being the World Police?","Is it okay for a European to do blackface?","What's your opinion on Police as an institution?","Do you know what's going on at Poland - Belarus border?","Americans, do you find Europeans on this sub annoying? Europeans, do you find Americans on this sub annoying?","Do you know who Jimmy Carter is?","Was the American firebombing of Japan was justified?","Westerners, if Russia invade Ukraine, should we start a war?","How do you feel about the right to bear arms?"],"13":["Is Abraham Lincoln the greatest president in U.S history?","Do you think patriotism is a dumb concept that uses tribalistic loyalty to distract from the observable benefit of humanity?","Do you support the death penalty?","Are you a gun owner?","Would you support it if the US withdrew from all of their military interventions around the world and shut down all of their 800+ military bases as rapidly as possible?"],"14":["Do you think patriotism is a dumb concept that uses tribalistic loyalty to distract from the observable benefit of humanity?","Do you consider it very important that the people who originally created your country's government would approve of the way politics is being done today?"],"15":["What time format do you use?"],"16":["Would you be in favor of politically banning all the elected officials in your country, in all parties, and starting from a clean slate?","Are you a right or left chewer?","Does political affiliation matter to you in a potential long-term partner?","Should we continue to wear masks in planes?","What do you think about the Paradox of Tolerance (\"you can't be tolerant toward intolerance\") and what is your political leaning?","Males of reddit, do you m*sturbate with your right of left hand?","Which hand do you nut with?","Are you pro-gun, or anti-gun?","Who do you blame for US manufacturing jobs being outsourced to China? + show political leaning","Which arm do you wear your watch on?","How do you wear your watch?","If WWIII was to break out with China what would you do if conscripted?","What's you sexuality and political ideology?","If you found out your friend supported the opposite political side, would you still be friends with them?","Do you agree with the statement that if somebody is apolitical it basically means “I have the privilege and luxury of not having to care”?","what finger do you use to scroll when holding a mouse?","Do you think that a truly globalist system is something we should strive to obtain? (Definition in body text)","Do you brush your teeth with your left hand or right hand?","Which earbud do you put in first?","What hand do you wipe your ass with?","Which hand do you use most on your smartphone?","Updated: What is your view on the current social justice movement?","My fellow Americans, do you feel safe being open about your political views with people of opposing views?","Where do you wear your watch?","Which plane seat do you prefer?","Which pocket do you put your phone in?","Do you downvote comments? And what is your political leaning?","do you believe in tax the rich?","Which hand do you put in your pocket more often?","Which hand do you throw a Frisbee with?","Would you rather have Fascism or Communism","Which ear do you hold the phone to?","Should Trump be impeached?","Men, do you masterbate with your left hand or right hand?","Do you think the act of voting is good (answer according to your political bias)?","How good are you at using your non-dominant hand?","Do you believe that people who believe in conspiracies or questionable interpretations of history, and as a result hold political views that are radically different from your own, must be either dumb or bad-intentioned?","Do you believe climate change is a real and significant problem?","If you just won one billion dollars would you agree to pay the 90% tax rate that some people are proposing for?","Which hand do you use to open a water bottle?","Do you and your parents generally agree politicly?","Is states' rights a good idea, even when it leads to some states passing bad policies that violate human rights?","Americans, are you cool with a female president?","Which would you rather be your dominate hand?","What is your opinion on communism?","Do you believe in free will?","What percentage of politicians in your country would you consider \"corrupt\"?","What hand do you use to open a fridge?","Do you care about the culture war?","\"It is good for state\/provincial governments to be able make laws on some issues, rather than the national government.\" Agree or disagree?","Should religion be kept out of politics?","Do you think patriotism is a dumb concept that uses tribalistic loyalty to distract from the observable benefit of humanity?","Do you wear your watch on your dominant hand?","How do you clap your hands?","What is your approval rating on Michelle Obama, and what is your political leaning?","Are you a Totalitarian?","Which is your dominant leg?","Americans, do you own a gun, and what side of the politcal spectrum are you on if you do?","Would it make you happy to see worse criminals get worse treatment in prison?","Should the Government be Bigger or Smaller?","On which arm do you wear you watch on?","Are you happy with what hand you use to write?","How was Donald Trump as a president?","What are your thoughts on Plan B?","What would you do about the US Supreme Court vacancy?","What do you think of Socialism?","Should we legalize methamphetamine, or at least decriminalize possession of it so those with an addiction can seek treatment?","Americans, how do you feel about Alabama?","If you've ever worn a watch, on which wrist did you wear it?","Do you like Star Trek: Strange New Worlds?","When you only have 1 earbud in which side is in usually?","Do you want to have kids?","what is your usual answer?","Do you support President Biden’s call to ban “assault weapons”?","What side of your mouth do you typically chew food on?","Do you own a firearm ?","Would you date someone on the opposite end of the political spectrum?","Based on everything we know for far, is Alec Baldwin responsible for the death? (Political edition)","Do you think biden is doing a good job in Afghanistan?","Do you feel that, in 2021, it is more important for you to criticize your own country's leaders than to criticize other countries' leaders?","Should body armor be illegal?","“He who does not work neither shall he eat.” - V. I. Lenin. Do you agree?","Does polictal leaning (left or right) bias how you feel about the Rittenhouse case?","(Corrected Mistakes) Are you Left or Right-Handed?","Americans, what did you think of Trump's presidency?","What hand do you wear your watch on?","Which hand do you hold the fried chicken with?","Do you like or admire Pete Buttigieg as a person?","Do you think America was better 50 years ago, and what political leanings do you have?","What pocket do you keep your phone in?","What is your dominant hand and what hand do you usually carry most things with?","For the same product, would you rather pay half the price from a company that opposes everything you believe, or double the price from a company that supports everything you believe?","do you think rich people are necessary in a society?","Would you support a law providing grants\/ tax benefits to those who build a new home rather than buying an existing one?","Where do you assign credit\/blame regarding the US Afghanistan withdrawal by Biden based on the Trump-Taliban negotiations of last year?"],"17":["Do you shave your armpits?"],"18":["Europeans would you want to move to the USA? US Americans would you want to move to Europe?"],"19":["Do you care about the “partygate” scandal for UK prime minister Boris Johnson?","Where is the first place you think of when you hear \"Birmingham\"?","You just got acceptance letters from these universities. Which one do you go to?"],"20":["On your mark, get set, go?"]}}